<template>
  <div>
    <p>
      <b>状态码分类：</b><br>
      <b>1xx：</b>信息。服务器收到请求，需要请求者继续执行操作<br>
      <b>2xx：</b>成功。操作被成功接收并处理<br>
      <b>3xx：</b>重定向。需要进一步操作已完成请求<br>
      <b>4xx：</b>客户端错误。请求包含语法错误或无法完成请求<br>
      <b>5xx：</b>服务端错误。服务器处理请求的过程中发生了错误<br>
    </p>
    <p>
      <b>常见http状态码：</b><br>
      <b>200：</b>请求成功<br>
      <b>204：</b>请求成功，但没有资源返回，不刷新页面也不导向新页面<br>
      <b>206：</b>范围请求成功，请求必须包含Range头信息来指示客户端希望得到的内容范围，并且可能包含if-Range来作为请求条件<br>
      <b>301：</b>永久重定向<br>
      <b>302：</b>临时重定向<br>
      <b>303：</b>临时重定向<br>
      <b>304：</b>条件get请求，通过提供一个头信息指出客户端希望只返回在指定日期后修改的资源，但是资源未被修改，所以服务器会返回304，并且不会返回任何资源<br>
      <b>307：</b>临时重定向<br>
      <b>400：</b>请求存在语法错误<br>
      <b>401：</b>未经许可（未授权），需要通过http认证<br>
      <b>403：</b>访问被服务器拒绝<br>
      <b>404：</b>请求的资源不存在<br>
      <b>500：</b>服务器内部错误<br>
      <b>503：</b>服务器超负载或正在停机维护，无法处理请求
    </p>
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>
