<template>
  <div class="main-container">
    <p>
      <b>进程：</b>对于操作系统来说，一个任务就是一个进程（Process）。比如打开浏览器就是启动一个浏览器进程，打开一个记事本，
      就是启动一个记事本进程，打开两个记事本就是启动两个记事本进程。
    </p>
    <p>
      <b>线程：</b>有些进程不止干一件事，比如Word，可以同时进行打字、拼音检查、打印等事情。在一个进程内部，同时干多件事，
      就需要同时运行多个“子任务”，我们把进程内部的这些“子任务”称为线程（Thread）。由于每个进程至少干一件事，所以一个进程至少有
      一个线程。当然像Word这种复杂的进程可以有多个线程同时执行，多线程的执行方式和多进程是一样的，也是由操作系统在多个线程
      之间来回切换，让每个线程都短暂地交替运行，看起来就像同时运行一样。当然真正的同时运行需要多核cpu才能实现。
    </p>
    <p>
      <b>异同：</b>
      <ul>
        <ol>1、每启动一个Word，系统就会为其分配内存（资源分配的最小单位），进程在执行时，其实是内部的线程在执行任务（cpu调度的最小单位）</ol>
        <ol>2、一个进程至少有一个线程</ol>
        <ol>3、每启动一个进程，系统就会为其分配地址空间</ol>
        <ol>4、线程是共享进程中的数据的</ol>
        <ol>5、多进程程序更加健壮。多线程只要有一个线程死掉了，整个程序就死掉了，而一个进程死掉不会对另一个进程造成影响</ol>
      </ul>
    </p>
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>
