<template>
  <div>
    <p>
      <b>为什么使用https？</b><br>
      http协议以明文方式发送内容，不提供任何方式的数据加密，如果攻击者截取了web浏览器和网站服务器之间的传输报文，就可以直接
      读其中的信息，因此，http协议不适合传输一些敏感信息。<br>
      https在http的基础上加入了SSL/TLS协议，SSL/TLS依靠证书来验证服务器的身份，并为浏览器和服务器之间的通信加密
    </p>
    <p>
      <b>https的主要作用：</b>
      <ul>
        <ol>1、建立一个信息安全通道，来保证数据传输的安全</ol>
        <ol>2、确认网站的真实性</ol>
      </ul>
    </p>
    <p>
      <b>https与http的主要区别：</b>
      <ul>
        <ol>1、https协议需要到CA申请证书</ol>
        <ol>2、http是超文本传输协议，信息是明文传输，https则是具有安全性的SSL/TLS加密传输协议</ol>
        <ol>3、http和https使用的是完全不同的连接方式，用的端口也不同，前者是80，后者是443</ol>
        <ol>4、http连接很简单，是无状态的；https协议可进行加密传输、身份认证的网络协议，比http协议安全</ol>
      </ul>
    </p>
    <p>
      <b>客户端在使用https方式与web服务器通信时的步骤：</b>
      <ul>
        <ol>1、要求与web服务器建立ssl连接</ol>
        <ol>2、web服务器收到客户端请求后，会将网站的证书信息（证书中包含公钥）传送一份给客户端</ol>
        <ol>3、客户端的浏览器与web服务器开始协商ssl/tls连接的安全等级，也就是信息加密的等级</ol>
        <ol>4、客户端的浏览器根据双方同意的安全等级，建立会话密钥，然后利用网站的公钥将会话秘钥加密，并传给网站</ol>
        <ol>5、web服务器利用自己的私钥解密出会话密钥</ol>
        <ol>6、web服务器利用会话秘钥加密与客户端之间的通信</ol>
      </ul>
    </p>
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>
